app/controllers/students_controller.rb

  def index
    @students = Student.all
    @students = Student.find
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]